# Assignment on Pandas (Basic)

In [1]:
import pandas as pd

In [26]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series

num_df = pd.Series([4, 8, 15, 16, 23, 42])

num_df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [3]:
type(num_df)

pandas.core.series.Series

In [4]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

random = ["alpha", 7 , "subzero", "splendid", "data", 222, "brsingr", "harrypotter", "animation", 96 ]

In [5]:
pd.Series(random)

0          alpha
1              7
2        subzero
3       splendid
4           data
5            222
6        brsingr
7    harrypotter
8      animation
9             96
dtype: object

In [6]:
type(pd.Series(random))

pandas.core.series.Series

In [ ]:
"""Q3. Create a Pandas DataFrame that contains the following data:

    Name   Age  Gender
   Alice    25  Female
    Bob     30   Male
   Claire   27  Female

Then, print the DataFrame."""

In [22]:
df = pd.DataFrame( [["Alice", 25, "Female"],["Bob", 30, "Male"], ["Claire", 27, "Female"]])

In [23]:
df.columns = ["Name","Age","Gender"]

In [24]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [27]:
'''Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans - A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns and be shown by "[[ ]]". 
    Series in pandas contains a single list which can store heterogeneous type of data, because of this, series is also considered as a 
    1-dimensional data structure and can be shown by " [ ] ". On the other hand, DataFrame is a 2-dimensional data structure which contains 
    multiple lists of heterogeneous type of data.
    
    e. g. 

'''

num_list = [1,2,3,4,5]

In [30]:
num_series = pd.Series(num_list)
print(type(num_series))
num_series

<class 'pandas.core.series.Series'>

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [31]:
num_df = pd.DataFrame(num_list)
print(type(num_df))
num_df

<class 'pandas.core.frame.DataFrame'>

   0
0  1
1  2
2  3
3  4
4  5

In [ ]:
'''Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of 
    these functions?
    Ans - df.head(), df.tail(), df.to_csv, df.to_excel are some of functions to manipulate data within dataframe.
    
    df.head(n) - Return the first `n` rows. This function returns the first `n` rows for the object based on position. It is useful for quickly 
    testing if your object has the right type of data in it.
    
    df.tail(n) - Return the last `n` rows. This function returns last `n` rows from the object based on position. It is useful for quickly 
    verifying data, for example, after sorting or appending rows.
'''

In [ ]:
'''Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans - All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable. 
    The length of a Series cannot be changed, but, for example, columns can be inserted into a DataFrame.
    
    '''

In [40]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

courses = pd.Series(["Data Science Masters(English)","Data Science Masters(Hinglish)"], name = "Course")
fees = pd.Series([3500,3500], name = "Fees")
mentors  = pd.Series([["Krish Naik","Sudhanshu Kumar"],["Krish Naik","Sudhanshu Kumar"]], name = "Mentors")

In [41]:
df_pwskills = pd.concat([courses,fees,mentors],axis=1)

In [42]:
df_pwskills

                           Course  Fees                        Mentors
0   Data Science Masters(English)  3500  [Krish Naik, Sudhanshu Kumar]
1  Data Science Masters(Hinglish)  3500  [Krish Naik, Sudhanshu Kumar]